Documents/ЗаданиеНаИнвентаризацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаданиеНаИнвентаризацию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Инвентаризация</xr:Item>
				<xr:Item>AccumulationRegister.ЗаданияНаИнвентаризацию</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвентаризация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Камера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Камеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоКамерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инвентаризация</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИнвентаризацияСклад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененияДвижений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Кладовщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Кладовщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закрыто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаданияНаИнвентаризацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаданияНаИнвентаризацию</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаИнвентаризацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ИнвентаризацияСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ИнвентаризацияСклад</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоНесколькимСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольОтветственныхЗаТовар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоТоварамБезРолиОтветственных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяВыставитьСчётНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоХолдингуВЦелом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеТехнологаНаДегустацию</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДегустациюНовинки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСборщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГоловнойКонтрагент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расхождение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просрочка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаданияНаИнвентаризацию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаданиеНаИнвентаризацию</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаданиеНаИнвентаризацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаданиеНаИнвентаризацию/Ext/ObjectModule.bsl
Перем ТекДата;


Функция ПолучитьТаблицуИзмененийВДвижениях()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистратор"	, ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Товары"		, ЭтотОбъект.Товары.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаданияНаИнвентаризацию.Номенклатура,
	|	ЗаданияНаИнвентаризацию.Характеристика,
	|	ЗаданияНаИнвентаризацию.ДатаПроизводства,
	|	СУММА(ЗаданияНаИнвентаризацию.Количество * ВЫБОР
	|			КОГДА ЗаданияНаИнвентаризацию.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА 1
	|			ИНАЧЕ -1
	|		КОНЕЦ) КАК Количество
	|ПОМЕСТИТЬ ВТ_Движения
	|ИЗ
	|	РегистрНакопления.ЗаданияНаИнвентаризацию КАК ЗаданияНаИнвентаризацию
	|ГДЕ
	|	ЗаданияНаИнвентаризацию.Регистратор = &Регистратор
	|	И ЗаданияНаИнвентаризацию.Активность = ИСТИНА
	|	И ЗаданияНаИнвентаризацию.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаИнвентаризацию.Номенклатура,
	|	ЗаданияНаИнвентаризацию.Характеристика,
	|	ЗаданияНаИнвентаризацию.ДатаПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧТовары.Номенклатура,
	|	ТЧТовары.Характеристика,
	|	ТЧТовары.ДатаПроизводства,
	|	ТЧТовары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТабТовары
	|ИЗ
	|	&Товары КАК ТЧТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_Движения.Номенклатура, ВЗ_Товары.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_Движения.Характеристика, ВЗ_Товары.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВТ_Движения.ДатаПроизводства, ВЗ_Товары.ДатаПроизводства) КАК ДатаПроизводства,
	|	ЕСТЬNULL(ВЗ_Товары.Количество, 0) - ЕСТЬNULL(ВТ_Движения.Количество, 0) КАК Количество
	|ИЗ
	|	ВТ_Движения КАК ВТ_Движения
	|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ТабТовары.Номенклатура КАК Номенклатура,
	|			ВТ_ТабТовары.Характеристика КАК Характеристика,
	|			ВТ_ТабТовары.ДатаПроизводства КАК ДатаПроизводства,
	|			СУММА(ВТ_ТабТовары.Количество) КАК Количество
	|		ИЗ
	|			ВТ_ТабТовары КАК ВТ_ТабТовары
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ТабТовары.Номенклатура,
	|			ВТ_ТабТовары.Характеристика,
	|			ВТ_ТабТовары.ДатаПроизводства) КАК ВЗ_Товары
	|		ПО ВТ_Движения.Номенклатура = ВЗ_Товары.Номенклатура
	|			И ВТ_Движения.Характеристика = ВЗ_Товары.Характеристика
	|			И ВТ_Движения.ДатаПроизводства = ВЗ_Товары.ДатаПроизводства
	|ГДЕ
	|	ЕСТЬNULL(ВЗ_Товары.Количество, 0) - ЕСТЬNULL(ВТ_Движения.Количество, 0) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Движения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ТабТовары";
				   
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ТекДата = ТекущаяДата(); //можно брать эту, т.к. код выполняется на сервере и дата будет серверная
		ТабИзмененийВДвижениях = ПолучитьТаблицуИзмененийВДвижениях();
		Если ТабИзмененийВДвижениях.Количество() > 0 Тогда
			СтрокаТаб = ЭтотОбъект.ИзмененияДвижений.Добавить();
			СтрокаТаб.ДатаИзменения = ТекДата;
			СтрокаТаб.Пользователь 	= ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
					
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		ЭтотОбъект.ИзмененияДвижений.Очистить();
		
	КонецЕсли;
	
	////
	//Если ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
	//	Запрос = Новый Запрос("ВЫБРАТЬ
	//						  |	МобильноеПриложение.Ссылка 
	//						  |ИЗ
	//						  |	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	//						  |ГДЕ
	//						  |	МобильноеПриложение.Магазин = &Магазин");
	//	
	//	Запрос.УстановитьПараметр("Магазин", СтруктурнаяЕдиница);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Если Выборка.Ссылка <> ПланыОбмена.МобильноеПриложение.ЭтотУзел() Тогда
	//			ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	//		КонецЕсли;
	//	КонецЦикла;  
	//КонецЕсли;
	//
	//Если НЕ ЭтоНовый() Тогда
	//	Запрос = Новый Запрос("ВЫБРАТЬ
	//	|	ЗаданиеНаИнвентаризацию.СтруктурнаяЕдиница
	//	|ИЗ
	//	|	Документ.ЗаданиеНаИнвентаризацию КАК ЗаданиеНаИнвентаризацию
	//	|ГДЕ
	//	|	ЗаданиеНаИнвентаризацию.Ссылка = &Ссылка");
	//	
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.СтруктурнаяЕдиница) Тогда
	//		Запрос = Новый Запрос("ВЫБРАТЬ
	//							  |	МобильноеПриложение.Ссылка 
	//							  |ИЗ
	//							  |	ПланОбмена.МобильноеПриложение КАК МобильноеПриложение
	//							  |ГДЕ
	//							  |	МобильноеПриложение.Магазин = &Магазин");
	//		
	//		Запрос.УстановитьПараметр("Магазин", Выборка.СтруктурнаяЕдиница);
	//		
	//		Выборка = Запрос.Выполнить().Выбрать();
	//		Пока Выборка.Следующий() Цикл
	//			Если Выборка.Ссылка <> ПланыОбмена.МобильноеПриложение.ЭтотУзел() Тогда
	//				ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	//			КонецЕсли;
	//		КонецЦикла;  
	//	КонецЕсли; 
	//КонецЕсли; 
	//
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	мДвижения = ЭтотОбъект.Движения.ЗаданияНаИнвентаризацию;
	мДвижения.Записывать = Истина;
	мДвижения.Очистить();
	
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Для Каждого СтрокаТЧ Из ЭтотОбъект.Товары Цикл
		Движение = мДвижения.ДобавитьПриход();
		Движение.Период 			= ТекДата;
		Движение.Задание			= ЭтотОбъект.Ссылка;
		Движение.Номенклатура 		= СтрокаТЧ.Номенклатура;
		Движение.Характеристика 	= СтрокаТЧ.Характеристика;
		Движение.ДатаПроизводства 	= СтрокаТЧ.ДатаПроизводства;
		Движение.Количество 		= СтрокаТЧ.Количество;
		Движение.АвторИзменений		= ТекПользователь;
	КонецЦикла;
	
	Если ЭтотОбъект.Закрыто Тогда //Надо остатки по заданию в регистре закрыть
		мДвижения.Записать();
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаданияНаИнвентаризациюОстатки.Задание,
		|	ЗаданияНаИнвентаризациюОстатки.Номенклатура,
		|	ЗаданияНаИнвентаризациюОстатки.Характеристика,
		|	ЗаданияНаИнвентаризациюОстатки.ДатаПроизводства,
		|	ЗаданияНаИнвентаризациюОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ЗаданияНаИнвентаризацию.Остатки(, Задание = &ТекущийДокумент) КАК ЗаданияНаИнвентаризациюОстатки";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = мДвижения.ДобавитьРасход();
			Движение.Период 		= ТекДата;
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.АвторИзменений	= ТекПользователь;
		КонецЦикла;	
	КонецЕсли;
	
	мДвижения = ЭтотОбъект.Движения.Инвентаризация;
	мДвижения.Записывать = Истина;
	мДвижения.Очистить();
	Если ЭтотОбъект.Закрыто Тогда //Надо остатки по заданию в регистре закрыть
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаданиеНаИнвентаризациюТовары.Номенклатура,
			|	ЗаданиеНаИнвентаризациюТовары.Характеристика,
			|	ЗаданиеНаИнвентаризациюТовары.ДатаПроизводства,
			|	СУММА(ЗаданиеНаИнвентаризациюТовары.Количество) КАК Количество,
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка.Дата,
			|	ВЫБОР
			|		КОГДА ЗаданиеНаИнвентаризациюТовары.Ссылка.Камера = ЗНАЧЕНИЕ(Справочник.Камеры.ПустаяСсылка)
			|			ТОГДА ЗаданиеНаИнвентаризациюТовары.Ссылка.Склад
			|		ИНАЧЕ ЗаданиеНаИнвентаризациюТовары.Ссылка.Камера
			|	КОНЕЦ КАК Склад,
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка.Инвентаризация КАК ДокументИнвентаризации,
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка.СтруктурнаяЕдиница,
			|	НАЧАЛОПЕРИОДА(ВЫБОР
			|			КОГДА ЗаданиеНаИнвентаризациюТовары.Ссылка.Инвентаризация = ЗНАЧЕНИЕ(Документ.ИнвентаризацияСклад.ПустаяСсылка)
			|				ТОГДА ЗаданиеНаИнвентаризациюТовары.Ссылка.Дата
			|			ИНАЧЕ ЗаданиеНаИнвентаризациюТовары.Ссылка.Инвентаризация.Дата
			|		КОНЕЦ, ДЕНЬ) КАК ДатаИнвентаризации
			|ИЗ
			|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданиеНаИнвентаризациюТовары
			|ГДЕ
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаданиеНаИнвентаризациюТовары.Номенклатура,
			|	ЗаданиеНаИнвентаризациюТовары.Характеристика,
			|	ЗаданиеНаИнвентаризациюТовары.ЕдиницаИзмерения,
			|	ЗаданиеНаИнвентаризациюТовары.ДатаПроизводства,
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка.Дата,
			|	ВЫБОР
			|		КОГДА ЗаданиеНаИнвентаризациюТовары.Ссылка.Камера = ЗНАЧЕНИЕ(Справочник.Камеры.ПустаяСсылка)
			|			ТОГДА ЗаданиеНаИнвентаризациюТовары.Ссылка.Склад
			|		ИНАЧЕ ЗаданиеНаИнвентаризациюТовары.Ссылка.Камера
			|	КОНЕЦ,
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка.Инвентаризация,
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка.СтруктурнаяЕдиница,
			|	НАЧАЛОПЕРИОДА(ВЫБОР
			|			КОГДА ЗаданиеНаИнвентаризациюТовары.Ссылка.Инвентаризация = ЗНАЧЕНИЕ(Документ.ИнвентаризацияСклад.ПустаяСсылка)
			|				ТОГДА ЗаданиеНаИнвентаризациюТовары.Ссылка.Дата
			|			ИНАЧЕ ЗаданиеНаИнвентаризациюТовары.Ссылка.Инвентаризация.Дата
			|		КОНЕЦ, ДЕНЬ)";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		мДвижения = ЭтотОбъект.Движения.Инвентаризация;
		мДвижения.Записывать = Истина;
		мДвижения.Очистить();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = мДвижения.Добавить();
			Движение.Период 		= Дата;
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
